/**
 * Created by vanki on 2017/2/21.
 */

/**
 * 后台返回CODE
 */
var ConstStatusCode = {
    CODE_200: [200, "成功"],
    CODE_301: [301, "请先登录"],
    CODE_400: [400, "参数不符"],
    CODE_403: [403, "无操作权限"],

    CODE_630: [630, "未找到上传图片"],
    CODE_631: [631, "图片上传数量过多，请分批上传"],

    CODE_1000: [1000, "用户已存在"],
    CODE_1001: [1001, "用户不存在"],
    CODE_1002: [1002, "用户名请包含字母和数字"],
    CODE_1003: [1003, "帐号或密码错误"],
    CODE_1004: [1004, "数量不足"],
    CODE_1005: [1005, "答案错误"],

    CODE_1100: [1100, "未找到图片资源"],
    CODE_1101: [1101, "图片上传数量过多"],
    CODE_1102: [1102, "验证码错误"],

    CODE_1120: [1120, "密码错误"],
    CODE_1121: [1121, "导出失败, 笔记内容为空"],
    CODE_1122: [1122, "标题长度不符"],
}